export default function get_branch_color(subway: string) {
    let backgorund;

    if (
        subway === "Беговая" ||
        subway === "Зенит" ||
        subway === "Приморская" ||
        subway === "Василеостровская" ||
        subway === "Гостиный Двор" ||
        subway === "Маяковская" ||
        subway === "Зенит" ||
        subway === "Пл.Александра Невского 1" ||
        subway === "Елизаровская" ||
        subway === "Ломоносовская" ||
        subway === "Пролетарская" ||
        subway === "Обухово" ||
        subway === "Рыбацкое"
    ) {
        backgorund = "#068200";
    }

    if (
        subway === "Дыбенко" ||
        subway === "Проспект Большевиков" ||
        subway === "Ладожская" ||
        subway === "Новочеркасская" ||
        subway === "Пл.Александра Невского 2" ||
        subway === "Лиговский проспект" ||
        subway === "Достоевская" ||
        subway === "Спасская"
    ) {
        backgorund = "#cc8400";
    }

    if (
        subway === "Девяткино" ||
        subway === "Гражданский проспект" ||
        subway === "Академическая" ||
        subway === "Политехническая" ||
        subway === "Площадь мужества" ||
        subway === "Лесная" ||
        subway === "Выборгская" ||
        subway === "Площадь Ленина" ||
        subway === "Чернышевская" ||
        subway === "Площадь Восстания" ||
        subway === "Владимирская" ||
        subway === "Пушкинская" ||
        subway === "Технологический институт 1" ||
        subway === "Балтийская" ||
        subway === "Нарвская" ||
        subway === "Кировский завод" ||
        subway === "Автово" ||
        subway === "Ленинский проспект" ||
        subway === "Проспект Ветеранов"
    ) {
        backgorund = "#d10600";
    }

    if (
        subway === "Парнас" ||
        subway === "Проспект Просвещения" ||
        subway === "Озерки" ||
        subway === "Удельная" ||
        subway === "Пионерская" ||
        subway === "Черная речка" ||
        subway === "Петроградская" ||
        subway === "Горьковская" ||
        subway === "Невский проспект" ||
        subway === "Сенная площадь" ||
        subway === "Технологический институт 2" ||
        subway === "Фрунзенская" ||
        subway === "Московские ворота" ||
        subway === "Электросила" ||
        subway === "Парк Победы" ||
        subway === "Московская" ||
        subway === "Звездная" ||
        subway === "Купчино"
    ) {
        backgorund = "#2722ff";
    }

    if (
        subway === "Комендантский проспект" ||
        subway === "Старая деревня" ||
        subway === "Крестовский остров" ||
        subway === "Чкаловская" ||
        subway === "Спортивная" ||
        subway === "Адмиралтейская" ||
        subway === "Садовая" ||
        subway === "Звенигородская" ||
        subway === "Обводной канал" ||
        subway === "Волковская" ||
        subway === "Бухаресткая" ||
        subway === "Международная" ||
        subway === "Проспект Славы" ||
        subway === "Дунайская" ||
        subway === "Шушары"
    ) {
        backgorund = "#6E0A78";
    }

    return backgorund;
}
